tutorials/incompressible/simpleSolver/ras/ACCM_airFoil2D/0/nut
/*---------------------------------------------------------------------------*\
Caelus 10.04
Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.8265e-06;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.8265e-06;
    }
    left
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    right
    {
        type            empty;
    }
    wall
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
