tutorials/incompressible/simpleSolver/ras/ACCM_airFoil2D/system/fvSolution
/*-------------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/
FoamFile
{
        version                         2.0;
        format                          ascii;
        class                           dictionary;
        location                        "system";
        object                          fvSolution;
}
//------------------------------------------------------------------------------

solvers
{
    p
    {
        solver                  PCG;
        preconditioner
        {
            preconditioner          GAMG;
            smoother                SSGS;
            cacheAgglomeration      true;
            nCellsInCoarsestLevel   10;
            agglomerator            algebraicPair;
            mergeLevels             1;
        }

        tolerance               1e-16;
        relTol                  0.01;
    }

    U
    {
        solver                  PBiCGStab;
        preconditioner          USGS;
        tolerance               1e-16;
        relTol                  0.1;
    }

    "(k|omega|nuTilda)"
    {
        solver                  PBiCGStab;
        preconditioner          USGS;
        tolerance               1e-16;
        relTol                  0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors    1;
    pRefCell                    0;
    pRefValue                   0;
    consistent                  yes;
    correctionFoam              yes;
}

// relexation factors

relaxationFactors
{
    p                           0.3;
    U                           0.7;
    nuTilda                     0.7;
    k                           0.7;
    omega                       0.7;
}
